LaphyB/senior-project/Software/FullTest/STM32_WPAN/App/app_ble.c
          if(index < CFG_MAX_CONNECTION)
          {
              if(BleApplicationContext.Device_Connection_Status[index] == HID_LP_CONNECTING)
                  BleApplicationContext.Device_Connection_Status[index] = HID_CONNECTED_CLIENT;
              else
                  BleApplicationContext.Device_Connection_Status[index] = HID_CONNECTED_SERVER;

              BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index] =
                  connection_complete_event->Connection_Handle;

              /* Request security - required for HID on Windows */
              //aci_gap_slave_security_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index]);
              printf("Security requested\r\n");
          }
          else
          {
              printf("No free connection slot!\r\n");
          }
      }
      break;
        
        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_connection_complete_event;
          p_enhanced_connection_complete_event = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          HW_TS_Stop(BleApplicationContext.Connection_mgr_timer_Id);

          APP_DBG_MSG(">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%x\n", p_enhanced_connection_complete_event->Connection_Handle);
          APP_DBG_MSG("     - Connection established with Central: @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_enhanced_connection_complete_event->Peer_Address[5],
                      p_enhanced_connection_complete_event->Peer_Address[4],
                      p_enhanced_connection_complete_event->Peer_Address[3],
                      p_enhanced_connection_complete_event->Peer_Address[2],
                      p_enhanced_connection_complete_event->Peer_Address[1],
                      p_enhanced_connection_complete_event->Peer_Address[0]);
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                      p_enhanced_connection_complete_event->Conn_Interval*1.25,
                      p_enhanced_connection_complete_event->Conn_Latency,
                      p_enhanced_connection_complete_event->Supervision_Timeout*10
                     );
           /* Find index of a connection not in HID_IDLE, HID_CONNECTED_SERVER or HID_CONNECTED_CLIENT state */
          index = 0;
          while((index < CFG_MAX_CONNECTION) &&
              ((BleApplicationContext.Device_Connection_Status[index] == HID_IDLE) ||
                  (BleApplicationContext.Device_Connection_Status[index] == HID_CONNECTED_SERVER) ||
                  (BleApplicationContext.Device_Connection_Status[index] == HID_CONNECTED_CLIENT)))
          {
            index++;
          }

          if(index < CFG_MAX_CONNECTION)
          {
            APP_DBG_MSG("First index in state %d: %d\n",
                        BleApplicationContext.Device_Connection_Status[index],
                        index);
            if(BleApplicationContext.Device_Connection_Status[index] == HID_LP_CONNECTING)
              /* Connection as client */
              BleApplicationContext.Device_Connection_Status[index] = HID_CONNECTED_CLIENT;
            else
              /* Connection as server */
              BleApplicationContext.Device_Connection_Status[index] = HID_CONNECTED_SERVER;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index] = p_enhanced_connection_complete_event->Connection_Handle;
          }
          else
          {
            APP_DBG_MSG("No stored connection in state different than HID_IDLE, HID_CONNECTED_CLIENT and HID_CONNECTED_SERVER!\n");
          }
          /* USER CODE BEGIN HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */

          /* USER CODE END HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }

        default:
          break;
      }
    }
    break; /* HCI_HCI_LE_META_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
        evt_blecore_aci *p_blecore_evt;
        p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;

        switch(p_blecore_evt->ecode)
        {
            case ACI_GAP_BOND_LOST_VSEVT_CODE:      // 0x0405
                printf("Bond lost\r\n");
                aci_gap_allow_rebond(
                    BleApplicationContext.BleApplicationContext_legacy.connectionHandle[0]);
                break;

            case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:  // 0x0401
                printf("Pairing complete\r\n");
                break;

            case ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE:  // 0x0C01
            {
                aci_gatt_attribute_modified_event_rp0 *pr =
                    (aci_gatt_attribute_modified_event_rp0*)p_blecore_evt->data;
                break;
            }

            case ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE:  // 0x0C13
            {
                aci_gatt_write_permit_req_event_rp0 *pr =
                    (aci_gatt_write_permit_req_event_rp0*)p_blecore_evt->data;
                aci_gatt_write_resp(
                    BleApplicationContext.BleApplicationContext_legacy.connectionHandle[0],
                    pr->Attribute_Handle, 0x00, 0x00, pr->Data_Length, pr->Data);
                break;
            }

            default:
                break;
        }
        break;
    }
      /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}


/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init(void)
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

